{"intents": [
  {"tag": "greeting",
    "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Good day", "Whats up", "Hey", "greetings"],
    "responses": ["Hello!", "Good to see you again!", "Hi there, how can I help?"],
    "context_set": ""
  },
  {"tag": "goodbye",
    "patterns": ["cya", "See you later", "Goodbye", "I am Leaving", "Have a Good day", "bye", "cao", "see ya"],
    "responses": ["Sad to see you go :(", "Talk to you later", "Goodbye!"],
    "context_set": ""
  },
  {"tag": "age",
    "patterns": ["how old", "how old is josh", "what is your age", "how old are you", "age?"],
    "responses": ["My owner Josh is 21 years old!", "21 years"],
    "context_set": ""
  },
  {"tag": "doing",
    "patterns": ["What are you doing", "doing", "wyd", "what you up to", "what you doin"],
    "responses": ["I am answering questions!", "Not much!", "Nothing right now!"],
    "context_set": ""
  },
  {"tag": "name",
    "patterns": ["what is you name", "what should I call you", "whats your name?", "who are you?", "Can you tell me your name"],
    "responses": ["I am BalanceBot!", "BalanceBot", "My name is BalanceBot and I focus on mental health and motivation!"],
    "context_set": ""
  },
  {"tag": "hobbies",
    "patterns": ["what do you like doing", "What are your hobbies", "hobbies", "what do you do for fun", "fun"],
    "responses": ["I like learning!", "My owner likes coding!", "My owner likes listening to music!"],
    "context_set": ""
  },
  {"tag": "thanks",
    "patterns": ["Thank you!", "thanks", "ty", "I appreciate it", "appreciate"],
    "responses": ["You're welcome!", "Yep!", "No problem!"],
    "context_set": ""
  },
  {"tag": "cool",
    "patterns": ["that's awesome!", "very cool", "that's lit", "wow", "so cool", "cool", "awesome"],
    "responses": ["I agree!", "Yep!", "Isn't it?"],
    "context_set": ""
  },
  {"tag": "quote",
    "patterns": ["quote", "can you tell me a quote?", "what is a quote", "what quotes do you know?", "tell me a quote"],
    "responses": ["Keep smiling, because life is a beautiful thing and there's so much to smile about. -Marilyn Monroe", 
    "You have brains in your head. You have feet in your shoes. You can steer yourself any direction you choose. -Dr. Seuss", 
    "Your time is limited, so don't waste it living someone else's life. Don't be trapped by dogma - which is living with the results of other people's thinking. -Steve Jobs", 
    "Many of life's failures are people who did not realize how close they were to success when they gave up. -Thomas A. Edison", 
    "The greatest glory in living lies not in never falling, but in rising every time we fall. -Nelson Mandela", 
    "The way to get started is to quit talking and begin doing. -Walt Disney", 
    "If life were predictable it would cease to be life, and be without flavor. -Eleanor Roosevelt", 
    "If you look at what you have in life, you'll always have more. If you look at what you don't have in life, you'll never have enough. -Oprah Winfrey", 
    "If you set your goals ridiculously high and it's a failure, you will fail above everyone else's success. -James Cameron", 
    "Life is what happens when you're busy making other plans. -John Lennon", 
    "Don't judge each day by the harvest you reap but by the seeds that you plant. -Robert Louis Stevenson", 
    "Do not go where the path may lead, go instead where there is no path and leave a trail. -Ralph Waldo Emerson", 
    "It is during our darkest moments that we must focus to see the light. -Aristotle", 
    "In the end, it's not the years in your life that count. It's the life in your years. -Abraham Lincoln", 
    "Never let the fear of striking out keep you from playing the game. -Babe Ruth", 
    "Life is either a daring adventure or nothing at all. -Helen Keller", 
    "The secret of success is to do the common thing uncommonly well. -John D. Rockefeller Jr.", 
    "The real test is not whether you avoid this failure, because you won't. It's whether you let it harden or shame you into inaction, or whether you learn from it; whether you choose to persevere. -Barack Obama", 
    "I find that the harder I work, the more luck I seem to have. -Thomas Jefferson", 
    "The question isn't who is going to let me; it's who is going to stop me. -Ayn Rand", 
    "Whether you think you can or you think you can't, you're right. -Henry Ford", 
    "Do not let making a living prevent you from making a life. -John Wooden", 
    "Love the life you live. Live the life you love. -Bob Marley", 
    "Life is trying things to see if they work. -Ray Bradbury", 
    "I never dreamed about success, I worked for it. -Estee Lauder", 
    "It is better to fail in originality than to succeed in imitation. -Herman Melville"],
    "context_set": ""
  },
  {"tag": "fact",
    "patterns": ["fact", "can you tell me a fact?", "what is a fact?", "what is a fact you know", "tell me a cool fact"],
    "responses": ["McDonald's once made bubblegum-flavored broccoli", 
    "Some fungi create zombies, then control their minds", 
    "The first oranges weren't orange",
    "There's only one letter that doesn't appear in any U.S. state name", 
    "A cow-bison hybrid is called a beefalo", 
    "Johnny Appleseed's fruits weren't for eating",
    "Scotland has 421 words for snow", 
    "Samsung tests phone durability with a butt-shaped robot", 
    "The Windy City name has nothing to do with Chicago weather", 
    "Peanuts aren't technically nuts", 
    "Armadillo shells are bulletproof", 
    "Firefighters use wetting agents to make water wetter", 
    "The longest English word is 189,819 letters long",
    "Octopuses lay 56,000 eggs at a time", 
    "Cats have fewer toes on their back paws", 
    "Kleenex tissues were originally intended for gas masks", 
    "Blue whales eat half a million calories in one mouthful", 
    "That tiny pocket in jeans was designed to store pocket watches", 
    "Bees can fly higher than Mount Everest", 
    "Ancient Egyptians used dead mice to ease toothaches", 
    "Paint used to be stored in pig bladders", 
    "Humans have jumped further than horses in the Olympics", 
    "The Terminator script was sold for $1", 
    "Pigeon poop is the property of the British Crown", 
    "Onions were found in the eyes of an Egyptian mummy"],
    "context_set": ""
  },
  {"tag": "motivation",
    "patterns": ["motivation", "can you tell me something motivating?", "i need motivation", "how do i get motivated?", "I need motivation for today", "motivational tips", "can you give me some tips for motivation", "give me some tips"],
    "responses": ["Be your own inspiration. There is nobody on this earth who knows you better than you do.", 
    "Do not allow yourself to be taken for granted at any point of time.", 
    "Build up self confidence by doing things you normally wouldn't.", 
    "Learn how to manage your time super efficiently. Once you break patterns of continuous dullness and a depressive rut, you will find yourself enter a new zone- one with possibilities of new achievements.", 
    "Don't be a people pleaser. Yes it is perfectly natural to want to make others happy by doing something we do even if it brings you a bit of discomfort. But unless the person means something to you and deserve the hours you spend toiling for them, don't subject yourself to unrewarding work.", 
    "Be forgiving of yourself. Whoever you have wronged and whatever mistakes you have done, no one else's forgiveness matters in real but yours.", 
    "The past holds you back. There is no point in living through your memories and good moments from the past- spend focus on making fresh memories and on living rather than reliving moments.", 
    "Find something that you find is actually worth living for. When everything else seems off in life, this something is the reason you get out of bed in the morning.", 
    "Gain worldwide knowledge and experience. Don't spend time reading inspirational stories but rather research on ways of how you can inspire and motivate yourself without having to live someone else's life.", 
    "Lastly, positive stress is the ultimate key. Set yourself some limitations and goals- target yourself at achieving these. Prioritise self goals and give yourself time to reach these.", 
    "Imagination, often turns into reality. Imagine a certain situation over and again, with love and joy, and sooner or later you will attract it into your life, provided you don't let contradictory thoughts enter your mind.", 
    "What you do every day will turn into a habit. Choose habits that will lead you to success and repeat them every day. In time, they will become automatic, not requiring thought, attention or effort.", 
    "Letting moods control your life is like sitting in a boat and letting the waves and currents take you wherever they please. Developing inner strength and self-discipline is like attaching a powerful engine to your boat.", 
    "Never lose hope, no matter how bleak things look. Hope is the rope that will pull you up. It is your connection, your stairway, to get your dreams and expectations realized. Never leave the rope of hope.", 
    "When reading inspirational books, articles or quotes, strive to read between the lines.", 
    "To get positive results from positive thinking, you should also take positive action.", 
    "Even if you live in poor or faraway place, you can achieve success.", 
    "Treat your time like money in the bank. What do you spend it on? Don't waste your time. Use it correctly.", 
    "Adopt an attitude of calmness and of open-mindedness. Such an attitude would make it easier for you to see new opportunities, conceive new ideas, focus on goals, and see things from a different point of view."],
    "context_set": ""
  }
]
}